benchmark/results/2026-07-11-local-docker/summary.json
{
  "jmeter": {
    "create": {
      "transaction": "Total",
      "sampleCount": 3530,
      "errorCount": 0,
      "errorPct": 0.0,
      "meanResTime": 5086.5152974504235,
      "medianResTime": 4976.0,
      "minResTime": 26.0,
      "maxResTime": 14736.0,
      "pct1ResTime": 11249.0,
      "pct2ResTime": 11335.45,
      "pct3ResTime": 14686.0,
      "throughput": 49.785625634660946,
      "receivedKBytesPerSec": 17.780202809432474,
      "sentKBytesPerSec": 18.363628109838658
    },
    "redirect": {
      "transaction": "Total",
      "sampleCount": 2208,
      "errorCount": 0,
      "errorPct": 0.0,
      "meanResTime": 16181.23550724637,
      "medianResTime": 18004.5,
      "minResTime": 44.0,
      "maxResTime": 33551.0,
      "pct1ResTime": 22548.0,
      "pct2ResTime": 33507.2,
      "pct3ResTime": 33544.0,
      "throughput": 22.698535080956052,
      "receivedKBytesPerSec": 6.228797224363916,
      "sentKBytesPerSec": 2.770817270624518
    }
  },
  "resourcePeaks": {
    "create": {
      "appCpuPct": 127.61,
      "appMemoryMiB": 1180.672,
      "mysqlCpuPct": 52.86,
      "redisCpuPct": 9.65
    },
    "redirect": {
      "appCpuPct": 301.71,
      "appMemoryMiB": 1180.672,
      "mysqlCpuPct": 45.82,
      "redisCpuPct": 28.46
    }
  }
}